#<b>მოვაწყოთ გარემო ფლასკში,</b> 

#ფლასკი არის მოდული / ბიბლიოთეკა , ასერომ მოგვიწევს, `flask` ბიბლიოთეკის დაყენება
#დასაყენებლად cmd-ში ვწერთ  `pip install flask` 

#გასათვალისწინებელია რომ python 2.6 ან ამ ვერსიაზე მაღალი უნდა იყოს დაყენებული, თუგბინდა რომ გამოვიყენოთ ფლასკი, უმჯობესია `პითონ3`

#ფლასკის სერვერის ჩასართავად(დასატესტად) გვჭირდება ეს კოდი/ქვემოთ:

#route ში ვუთითებთ რაიმე სახელს რომელიც იქნება საიტის URL და სახელის შეყვანის შემდეგ გამოიძახებს ფუნქციას.
from flask import Flask
app = Flask(__name__)

@app.route('/')
def hello_world():
   return 'Hello World'

if __name__ == '__main__':
   app.run()
 
# .run() ში ხდება პარამეტრების გაწერა როგირცაა host , port , debug , options მაგ, app.run(host='192.168.1.3',port='8080')


# - - - - - -   
#დებაგ მოდის ჩასართავად ვიყენებთ ამ კოდს: `app.debug=True` 
#Debug mode მაშინ გვჭირდება როცა მიმდინარეობს ვებ საიტის აგება, ვებსერვერის გამორთვის გარეშე ახდენს ცვლილებებს კოდში.

from flask import Flask
app = Flask(__name__)

@app.route('/')
def hello_world():
   return 'Hello World'

if __name__ == '__main__':
   app.debug = True
   app.run()
