from selenium import webdriver

driver = webdriver.Chrome('C:\\Users\\user\\Desktop\\chromedriver.exe') # პარამეტრად შევა მისამართი ქრომდარივერის რომელსაც გადმოვწერთ სელენიუმის მთავარი ვებსაიტიდან
##ამ ორი ხაზის შემდეგ თუ გავუშვებთ კოდს, ამოვარდება ბრაუზერის ფანჯარა, ამის შემდეგ ჩვენი სურვილისამებრ მოვახდენთ ავტომატიზაციას.                                                                                  

driver.get('https://www.website.com/home/us/') # ამით შევა მოცემულ ბმულზე.

z=driver.find_element_by_css_selector('a') # შეეცდება css სელექტორი 'a' ს ელემენტი და მისამართი იპოვოს თუ იპოვის
z.click() # მაგ ელემენტს დააკლიკებს,
z.back() # ამით უკან დაბრუნება მოხდება 


#### Version 2.
# ელემენტის პოვნა შესაძლებელია ბევრნაირად, სხვადასხვა ხერხით, 
# ელემენტის საპოვნელად მეორე ვერსიაა XML ის Xpath. ით პოვნა. 
# xpath ის შოვნა შესაძლებელია inspect იდან, ასევე ხელითაც შეგვიძლია დაწერა. მაგალითი - '//a[@href="rame"]'
# // ის მერე თეგი და ძაღლუკას შიგნით ატრიბუტი და ატრიბუტის მონაცემი.

b=driver.find_element_by_xpath('//a[@href="https://discord.gg/BnmzUez9"]')
b.click()
b.back()
